{
  "education": [
    {
      "awards_achievements": [
        "GPA: 2.92/4.0"
      ],
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science",
      "duration": "2013 - 2020",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_GabrielChan",
  "highlighted_projects": [
    {
      "description": "Developed a Unity video game alongside 13 other peers including fellow developers, artists, animators and composers. The players takes the role of a raccoon mom causing as much damage as possible to a construction site in an effort to protect her children. I designed the artificial intelligence of enemies (construction workers) and designed a handful of UI elements.",
      "git_url": "https://github.com/jialori/TrashPanda",
      "name": "Trash Panda Unity Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Jarvis Linux Cluster Administration manages about 10 nodes each using the CentOS 7 Linux distribution. These nodes are also connected through a switch and are able to communicate using internal IPv4 addresses. The purpose of this project is to track and record the performance of each node as well as the resources each node uses. This data will be stored in an RDBMS database and used to generate reports for plans regarding future nodes.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Gabriel Chan",
  "others": [
    {
      "bullets": [
        "Video Games",
        "Anime TV shows"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed back end of multiple projects. Participated in Scrum meetings with peers daily and at the end of each sprint.",
      "duration": "October,2021 - February,2022,June,2022 - present",
      "title": "Software Developer"
    },
    {
      "company": "National Bank of Canada",
      "description": "Designed and executed tests to ensure proper performance of web applications. Participated in Scrum meetings with peers daily and at the end of each sprint.",
      "duration": "February,2022 - June,2022",
      "title": "Quality Assurance Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Bash",
      "Unity",
      "SQL",
      "Git",
      "Artificial Intelligence"
    ],
    "familiar": [
      "HTML",
      "Javascript",
      "CSS",
      "React",
      "Docker"
    ],
    "proficient": [
      "Java",
      "Python",
      "C/C#",
      "Agile/Scrum",
      "Object Oriented Programming"
    ]
  },
  "summary": "I graduated from University of Toronto, St. George campus as a Computer Science specialist. I studied a wide range of programming languages including Python, Java and C. I have also worked on many group projects with groups as large as 13 other peers.I've taken many Computer Science courses so I am familiar with a wide range of programming languages. I have also learned about many programming principles such as Object Oriented Programming as well as Software Development Life Cycles. I've also taken a handful of mathematics courses so I am familiar with some mathematical concepts like Calculus and Linear Algebra."
}
